![imagen](./img/sql_murder.png)

# Ejercicio SQL Murder
Para este ejercicio vas a ponerte la gabardina y el sombrero ya que tendrás que investigar un asesinato en *SQL City*. 

Aplicarás los conecptos básicos de SQL y aprenderás a manejarte con un modelo de datos, mientras resuelves un caso de asesinato :)

Este espectacular juego está creado por **Joon Park y Cathy He**, y podrás encontrar todos los detalles en [su web](http://mystery.knightlab.com)

Para realizar el ejercicio tienes dos opciones, o bien desde la propia web, donde encontrarás un intérprete de sentencias SQL interactivo. Si usas esta opción te recomiendo que vayas apuntando las queries y sus outputs. O la otra opción es [acudir a su GitHub](https://github.com/NUKnightLab/sql-mysteries), descargarte la base de datos y realizar las queries desde Jupyter. Probablemente la primera opción te sea más cómoda


### Enunciado
A crime has taken place and the detective needs your help. The detective gave you the crime scene report, but you somehow lost it. You vaguely remember that the crime was a **murder** that occurred sometime on **Jan.15, 2018** and that it took place in **SQL City**. Start by retrieving the corresponding crime scene report from the police department’s database.


### Modelo de datos
![imagen](./img/sql_game_schemma.png)

¡Suerte Sherlock!

In [25]:
import pandas as pd
import sqlite3

In [26]:
path = "sql-murder-mystery.db"
connection = sqlite3.connect(path)
curs = connection.cursor()

In [27]:
query = """
SELECT *   
FROM person
"""

In [28]:
my_query = curs.execute(query)
def sql_query(query):

    curs.execute(query)
    datos_query = curs.fetchall()
    col_names = [description[0] for description in curs.description]
    return pd.DataFrame(datos_query, columns= col_names)

In [33]:
pd.read_sql_query(query, connection)
pd.set_option('max_colwidth', 800)

In [34]:
query = """
SELECT p.name as "name", i.transcript
FROM interview i 
JOIN person p ON p.id = i.person_id
WHERE i.transcript LIKE "%saw%" OR "%kill%"
"""
pd.read_sql_query(query, connection)

,name,transcript
0,Junior Krason,cupboards and book-shelves; here and there she saw maps and pictures\n
1,Inocencia Stalder,without a cat! It’s the most curious thing I ever saw in my life!’\n
2,Blair Rexford,it ran away when it saw mine coming!’\n
3,Lupita Vasiliou,one corner of it: ‘No room! No room!’ they cried out when they saw Alice\n
4,Sherryl Baquero,cupboards and book-shelves; here and there she saw maps and pictures\n
5,Alberto Rascoe,it ran away when it saw mine coming!’\n
6,Ross Savage,one corner of it: ‘No room! No room!’ they cried out when they saw Alice\n
7,Reynaldo Feleppa,"jumped; but she saw in another moment that it was addressed to the baby,\n"
8,Tu Heckle,into the loveliest garden you ever saw. How she longed to get out of\n
9,Ivan Hardister,"saw the White Rabbit. She was a little nervous about it just at first,\n"
10,Florance Kuhnel,cupboards and book-shelves; here and there she saw maps and pictures\n
11,Tammy Furno,"saw the White Rabbit. She was a little nervous about it just at first,\n"
12,Shirley Stachowicz,cupboards and book-shelves; here and there she saw maps and pictures\n
13,Tran Riedell,"saw the White Rabbit. She was a little nervous about it just at first,\n"
14,Quyen Reust,"the last time she saw them, they were trying to put the Dormouse into\n"
15,Yong Brank,"resting in the shade: however, the moment they saw her, they hurried\n"
16,Gertrudis Amacher,it ran away when it saw mine coming!’\n
17,Zackary Giesel,"resting in the shade: however, the moment they saw her, they hurried\n"
18,Curt Stanczyk,one corner of it: ‘No room! No room!’ they cried out when they saw Alice\n
19,Adelle Huisinga,"The Cat only grinned when it saw Alice. It looked good-natured, she\n"
20,Jenniffer Othman,"saw the White Rabbit. She was a little nervous about it just at first,\n"
21,Olene Arnhart,into the loveliest garden you ever saw. How she longed to get out of\n
22,Gus Bullmore,without a cat! It’s the most curious thing I ever saw in my life!’\n
23,Dannielle Leetch,"resting in the shade: however, the moment they saw her, they hurried\n"
24,Denver Orzell,"jumped; but she saw in another moment that it was addressed to the baby,\n"
25,Morty Schapiro,"I heard a gunshot and then saw a man run out. He had a ""Get Fit Now Gym"" bag. The membership number on the bag started with ""48Z"". Only gold members have those bags. The man got into a car with a plate that included ""H42W""."
26,Annabel Miller,"I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th."

In [35]:
query="""
SELECT *
FROM crime_scene_report
WHERE type = "murder" AND date LIKE "2018%" AND city = "SQL City"
"""
pd.read_sql_query(query, connection)

,date,type,description,city
0,20180215,murder,REDACTED REDACTED REDACTED,SQL City
1,20180215,murder,Someone killed the guard! He took an arrow to the knee!,SQL City
2,20180115,murder,"Security footage shows that there were 2 witnesses. The first witness lives at the last house on ""Northwestern Dr"". The second witness, named Annabel, lives somewhere on ""Franklin Ave"".",SQL City

In [42]:
query="""
SELECT p.name
FROM drivers_license d
JOIN person p ON d.id = p.id
WHERE d.plate_number = "%H42W%"
"""
pd.read_sql_query(query, connection)

Empty DataFrame
Columns: [name]
Index: []

In [48]:
query= """
SELECT *
FROM person p
JOIN get_fit_now_member gm ON gm.id = p.id
JOIN get_fit_now_check_in gc ON gc.membership_id = gm.id
WHERE membership_status = "gold"
GROUP BY p.name
"""
pd.read_sql_query(query, connection)

,id,name,license_id,address_number,address_street_name,ssn,id,person_id,name,membership_start_date,membership_status,membership_id,check_in_date,check_in_time,check_out_time
0,58636,Valentine Jarmon,371657,929,Ren Blvd,379995654,58636,62536,Harvey Jennkie,20180325,gold,58636,20170806,1029,1186

In [53]:
query= """
SELECT *
FROM person p
JOIN get_fit_now_member gm ON gm.id = p.id
WHERE membership_status = "gold"
"""
pd.read_sql_query(query, connection)

,id,name,license_id,address_number,address_street_name,ssn,id,person_id,name,membership_start_date,membership_status
0,58636,Valentine Jarmon,371657,929,Ren Blvd,379995654,58636,62536,Harvey Jennkie,20180325,gold

In [58]:
query= """
SELECT *
FROM person p
WHERE address_street_name = "Northwestern Dr"
"""
pd.read_sql_query(query, connection)

,id,name,license_id,address_number,address_street_name,ssn
0,10010,Muoi Cary,385336,741,Northwestern Dr,828638512
1,12711,Norman Apolito,667757,599,Northwestern Dr,778264744
2,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949
3,15171,Weldon Penso,336999,311,Northwestern Dr,131379495
4,17729,Lasonya Wildey,439686,3824,Northwestern Dr,917817122
5,18376,Josh Shi,653712,1091,Northwestern Dr,193899001
6,19420,Cody Schiel,890431,3524,Northwestern Dr,947110049
7,22239,Dusty Sigafus,710517,1125,Northwestern Dr,724386723
8,23044,Val Portlock,924989,3143,Northwestern Dr,100593316
9,23960,Kristopher Lagerberg,658777,1392,Northwestern Dr,492912529
10,25615,Olevia Morena,388477,812,Northwestern Dr,962831331
11,26758,Angelena Billman,942074,629,Northwestern Dr,341854756
12,28360,Rashad Cascone,924517,3212,Northwestern Dr,838907424
13,29608,Willetta Lurvey,800568,1028,Northwestern Dr,843751378
14,33415,Homer Simpson,108392,981,Northwestern Dr,871392019
15,34155,Allyson Lazenson,814209,2840,Northwestern Dr,991150469
16,34352,Vincenza Burkhardt,436470,2512,Northwestern Dr,197913046
17,36378,Freddie Ellzey,267882,3449,Northwestern Dr,474117596
18,39688,Abe Roeker,537445,689,Northwestern Dr,438969447
19,40336,Fredia Billeter,251082,404,Northwestern Dr,108056488
20,40760,Renata Faver,976650,745,Northwestern Dr,547572040
21,44004,Alison Eska,327797,2951,Northwestern Dr,306417867
22,44542,Ivory Mcgrevey,873842,897,Northwestern Dr,988557407
23,51114,Christena Saffell,814284,3055,Northwestern Dr,247657547
24,51552,Bonita Knie,764124,1726,Northwestern Dr,597137908
25,53076,Boris Bijou,664914,3327,Northwestern Dr,401191868
26,53699,Christian Pagano,628433,2585,Northwestern Dr,644772304
27,53890,Sophie Tiberio,957671,3755,Northwestern Dr,442830147
28,54564,Sammie Sengun,217286,2590,Northwestern Dr,848854310
29,55130,Shiloh Huntoon,472118,951,Northwestern Dr,826647644
30,59307,Cyril Yongue,753524,2903,Northwestern Dr,866057839
31,68690,Yer Modest,852404,3046,Northwestern Dr,419238039
32,70485,Andera Kostelecky,354822,1252,Northwestern Dr,787423012
33,71924,Laurie Scronce,774116,1418,Northwestern Dr,254883636
34,72076,Courtney Bordeaux,324614,1707,Northwestern Dr,347966356
35,73368,Torie Thalmann,773862,3697,Northwestern Dr,341559436
36,75484,Del Tacderen,447887,607,Northwestern Dr,243821337
37,80921,Donovan Yackley,222395,2386,Northwestern Dr,515049359
38,81052,Calvin Czelusniak,471483,1516,Northwestern Dr,657531837
39,81885,Kurtis Masuda,934201,2108,Northwestern Dr,201272595
40,85280,Donn Duin,569122,540,Northwestern Dr,613873810
41,87456,Leonora Wolfsberger,215868,3483,Northwestern Dr,565203106
42,88423,Teri Ehrich,510876,1879,Northwestern Dr,248637345
43,89906,Kinsey Erickson,510019,309,Northwestern Dr,635287661
44,90397,Dionna Kranwinkle,797260,2678,Northwestern Dr,278964807
45,93509,Emmitt Aceuedo,916706,3491,Northwestern Dr,979073160
46,96178,Galina Khuu,450248,2183,Northwestern Dr,398518185
47,96595,Coretta Cubie,303645,3631,Northwestern Dr,378403829
48,98593,Jonah Toner,578982,2947,Northwestern Dr,745853548
49,99826,Ivy Kazarian,994470,892,Northwestern Dr,208359813

In [62]:
query= """
SELECT *
FROM person p
WHERE name = "Annabel"
"""
pd.read_sql_query(query, connection)

Empty DataFrame
Columns: [id, name, license_id, address_number, address_street_name, ssn]
Index: []

In [72]:
query= """
SELECT gc.membership_id, p.name, gm.membership_status, gm.membership_start_date, gc.check_in_date
FROM person p
JOIN get_fit_now_member gm ON gm.person_id = p.id
JOIN get_fit_now_check_in gc ON gc.membership_id = gm.id
WHERE gc.membership_id LIKE "48Z%" AND gm.membership_status = "gold"
"""
pd.read_sql_query(query, connection)

,membership_id,name,membership_status,membership_start_date,check_in_date
0,48Z7A,Joe Germuska,gold,20160305,20180109
1,48Z55,Jeremy Bowers,gold,20160101,20180109

In [68]:
query= """
SELECT gc.membership_id, p.name
FROM person p
JOIN get_fit_now_member gm ON gm.person_id = p.id
JOIN get_fit_now_check_in gc ON gc.membership_id = gm.id
"""
pd.read_sql_query(query, connection)

     membership_id             name
0            NL318  Everette Koepke
1            NL318  Everette Koepke
2            NL318  Everette Koepke
3            NL318  Everette Koepke
4            NL318  Everette Koepke
...            ...              ...
2698         4KB72       Emile Hege
2699         4KB72       Emile Hege
2700         48Z7A     Joe Germuska
2701         48Z55    Jeremy Bowers
2702         90081   Annabel Miller

[2703 rows x 2 columns]

In [76]:
query= """
SELECT p.name, d.plate_number
FROM person p
JOIN drivers_license d ON d.id = p.license_id
WHERE d.plate_number LIKE "%H42W%"
"""
pd.read_sql_query(query, connection)

             name plate_number
0  Tushar Chandra       4H42WR
1   Jeremy Bowers       0H42W2
2  Maxine Whitely       H42W0X

In [79]:
query="""
SELECT p.name as "name", i.transcript
FROM interview i 
JOIN person p ON p.id = i.person_id
WHERE p.name = "Jeremy Bowers"
"""
pd.read_sql_query(query,connection)

,name,transcript
0,Jeremy Bowers,"I was hired by a woman with a lot of money. I don't know her name but I know she's around 5'5"" (65"") or 5'7"" (67""). She has red hair and she drives a Tesla Model S. I know that she attended the SQL Symphony Concert 3 times in December 2017.\n"